app/Controllers/Lokasi.php

    public function index()
    {
        $model = new ModelLokasi();
        $data['lokasi'] = $model->findAll();
---
SELECT *
FROM `tb_lokasi`

    public function pemetaanLokasi()
    {
        $model = new ModelLokasi();
        $data['lokasi'] = $model->findAll();
---
SELECT *
FROM `tb_lokasi`

    public function getStatistics()
    {
        $model = new ModelLokasi();
        $allSchools = $model->findAll();
---
SELECT *
FROM `tb_lokasi`