app/Controllers/Search.php

SELECT *
FROM `tb_lokasi`
---
    public function index()
    {
        $model = new ModelLokasi();
        $data['schools'] = $model->findAll();